-- Создание базы данных "Библиотека колледжа"
CREATE DATABASE College_Library ON
(
NAME = College_Library_dat,
FILENAME = "E:\DatabasesCollegeLibrary\library.mdf",
SIZE = 50,
MAXSIZE = 300,
FILEGROWTH = 2
)
LOG ON 
(
NAME = College_Library_log,
FILENAME = "E:\DatabasesCollegeLibrary\library.ldf",
SIZE = 30,
MAXSIZE = 200,
FILEGROWTH = 1
)
go

-- Проверка наличия базы данных
USE master
SELECT * FROM sysdatabases WHERE name = 'College_Library';

-- Создание таблиц
USE College_Library
CREATE TABLE [Group] (
IdGroup int IDENTITY(1,1) NOT FOR REPLICATION,
IdProfessor smallint NOT NULL,
NumberGroup smallint NOT NULL,
Training_Profile nvarchar(50) NOT NULL
);
 
CREATE TABLE Student (
IdStudent int IDENTITY(1,1) NOT FOR REPLICATION,
Name nvarchar(60) NOT NULL,
Surname nvarchar(60) NOT NULL,
Lastname nvarchar(60),
IdGroup int NOT NULL
);

CREATE TABLE Professor (
IdProfessor smallint IDENTITY(1,1) NOT FOR REPLICATION,
Name nvarchar(60) NOT NULL,
Surname nvarchar(60) NOT NULL,
Lastname nvarchar(60),
Position nvarchar(100) NOT NULL
);

CREATE TABLE Library_Card (
IdStudent int NOT NULL,
IdLibraryCard int IDENTITY(1,1) NOT NULL,
Number_LibraryCard varchar(20) NOT NULL
);

CREATE TABLE Form (
IdStudent int NOT NULL,
IdForm int NOT NULL,
IdBook int NOT NULL,
IdRecord int NOT NULL,
DateRecord date NOT NULL,
StatusBook nvarchar(15) NOT NULL
);

CREATE TABLE Book (
IdBook int IDENTITY(1,1) NOT NULL,
Name_book nvarchar(100) NOT NULL,
Author nvarchar(80) NOT NULL,
Publisher nvarchar(80) NOT NULL,
Year_of_Publishing date NOT NULL,
LBC nvarchar(40) NOT NULL,
Amount int NOT NULL,
IdStore int NOT NULL
);

CREATE TABLE Store (
IdStore int NOT NULL,
NumberShelf smallint NOT NULL,
NumberBook int NOT NULL
);

SELECT * FROM INFORMATION_SCHEMA.TABLES WHERE TABLE_NAME = 'Student';
SELECT * FROM sys.objects WHERE type in (N'U')

--Модификация таблиц (добавление первичных ключей)
ALTER TABLE Professor ADD CONSTRAINT pk_IdProfessor PRIMARY KEY (IdProfessor);
ALTER TABLE [Group] ADD CONSTRAINT pk_IdGroup PRIMARY KEY (IdGroup);
ALTER TABLE Student ADD CONSTRAINT pk_IdStudent PRIMARY KEY (IdStudent);
ALTER TABLE Library_Card ADD CONSTRAINT pk_IdLStudent PRIMARY KEY (IdStudent);
ALTER TABLE Form ADD CONSTRAINT pk_IdRecord PRIMARY KEY (IdRecord);
ALTER TABLE Book ADD CONSTRAINT pk_IdBook PRIMARY KEY (IdBook);
ALTER TABLE Store ADD CONSTRAINT pk_IdStore PRIMARY KEY (IdStore);

--Проверка создания первичных ключей
SELECT * FROM sysobjects WHERE [type] = 'k';
SELECT * FROM INFORMATION_SCHEMA.TABLE_CONSTRAINTS;

--Создание связей между таблицами
ALTER TABLE Student ADD CONSTRAINT fk_idGroup FOREIGN KEY (IdGroup) REFERENCES [Group] (IdGroup);
ALTER TABLE [Group] ADD CONSTRAINT fk_ifProfessor FOREIGN KEY (IdProfessor) REFERENCES Professor (IdProfessor);
ALTER TABLE Library_Card ADD CONSTRAINT fk_IdStudentt FOREIGN KEY (IdStudent) REFERENCES Student (IdStudent);
ALTER TABLE Form ADD CONSTRAINT fk_IdStudent FOREIGN KEY (IdStudent) REFERENCES Library_Card (IdStudent);
ALTER TABLE Form ADD CONSTRAINT fk_IdBook FOREIGN KEY (IdBook) REFERENCES Book (IdBook);
ALTER TABLE Book ADD CONSTRAINT fk_IdStore FOREIGN KEY (IdStore) REFERENCES Store (IdStore);

--Заполнение таблиц
use College_Library;

INSERT INTO Professor VALUES
('Мелания','Чернышева','Дмитриевна','Преподаватель общеобразовательных дисциплин'),
('Никита','Казаков','Елисеевич','Преподаватель специальных дисциплин'),
('Агния','Иванова','Павловна','Преподаватель общеобразовательных дисциплин'),
('Степан','Волошин','Данилович','Преподаватель специальных дисциплин'),
('Полина','Овсяникова','Алексеевна','Преподаватель специальных дисциплин'),
('Айлин','Полякова','Григорьевна','Преподаватель специальных дисциплин'),
('Захар','Гришин','Ярославич','Преподаватель общеобразовательных дисциплин'),
('Густав','Рыбаков','Павлович','Преподаватель специальных дисциплин');
SELECT * FROM Professor;
go

INSERT INTO [Group] VALUES
(1, 123, 'Администрирование баз данных'),
(2, 221, 'Обеспечение информационной безопасности'),
(3, 335, 'Обеспечение компьютерных сетей'),
(4, 454, 'Разработка веб приложений'),
(5, 222, 'Программирование'),
(6, 326, 'Сопровождение информационных систем'),
(7, 423, 'Администрирование баз данных');
SELECT * FROM [Group];
SELECT Count(*), Training_Profile FROM [Group] GROUP BY Training_Profile;
go

INSERT INTO Student VALUES
('Кира','Степанова','Андреевна',1),('Евгений','Кудрявцев','Алексеевич',1),
('Эрнест','Островски','',2),('Мария','Комарова','Давидовна',2),
('Андрей','Петров','Александрович',3),('Чин','Соен','',3),
('Артем','Карташов','Маркович',4),('Майя','Сергеева','Артуровна',4),
('Пи','Воль','',3),('Софья','Тарасова','Максимовна',5),
('Виктор','Пилецкий','Варшов',5),('Михаил','Маслов','Петрович',5),
('Диана','Никитина','Леоновна',6),('Леона','Калинина','Георгиевна',6),
('Платон','Бессонов','Артемович',6),('Сократ','Новиков','Александрович',7),
('Персефона','Макарова','Александровна',7),('Геката','Куприянова','Никитична',7),
('Гея','Галкина','Леоновна',1),('Марсель','Григорьев','Игоревич',1),
('Али','Орлов','Михайлова',2),('Филипп','Левин','Степанович',2),
('Илья','Латышев','Артемивеч',3),('Амелия','Акимова','Александровна',3),
('Николай','Маркин','Ильич',4),('Роксана','Малиновская','',4),
('Софья','Евдокимова','Руслановна',5),('Сава','Беляков','Львович',5),
('Илья','Евельянов','Константинович',6),('Ева','Орлова','Данииловна',6),
('Кира','Жукова','Макаровна',7),('Михаил','Артамонов','Даниилович',7),
('Максим','Орлов','Романович',3),('Полина','Черкасова','Георгиевна',3),
('Николай','Волков','Кириллович',1),('Кирилл','Егоров','Тимофеевич',1),
('Андрей','Юрьевич','Соболев',2),('Ярослав','Высоцкий','Андреевич',2),
('Варвара','Ермакова','Михайловна',4),('Андрей','Бородин','Ярославович',4),
('Марк','Фокин','Павловтч',5),('Дмитрий','Кириллов','Адамович',5),
('Сан','Мина','',3),('Чин','Чиюн','',3),
('Анна','Жукова','Андреевна',3),('Василиса','Ларионова','Кондратьевна',5),
('Максим','Волков','Тимурович',1),('Леонид','Левин','Матвеевич',1),
('Юлия','Третьякова','Германовна',6),('Герман','Сотников','Федорович',6),
('Тимур','Булгаков','Михайлович',7),('Стефания','Жукова','Елисеевна',7),
('Валерия','Уткина','Матвеевна',2),('Максим','Макаров','Арсеньевич',2),
('Аста','Хилтунен','',4),('Михоко','Юдзира','',4),
('Алена','Архипова','Тимофеевна',4);

SELECT * FROM Student;
SELECT COUNT(*) FROM Student;
go

INSERT INTO Library_Card VALUES
(2,'20605251641'),(3,'99637613843'),(4,'39776971754'),(5,'56992383264'),(6,'09554010361'),
(7,'33180728590'),(8,'87696006121'),(9,'80831829741'),(10,'67380735057'),(11,'94893245405'),
(12,'26234584995'),(13,'26636029228'),(14,'60590442200'),(15,'06490695393'),(16,'54155325546'),
(17,'43325533093'),(18,'42368149126'),(19,'34663795815'),(20,'08217310100'),(21,'79492011057'),
(22,'40387895808'),(23,'43915137429'),(24,'84119868434'),(25,'82192659635'),(26,'40069767439'),
(27,'40708484856'),(28,'68625235503'),(29,'73819731106'),(30,'97656188577'),(31,'98846007598'),
(32,'86213371930'),(33,'94152904356'),(34,'16926020857'),(35,'96744143742'),(36,'38256221085'),
(37,'92798180232'),(38,'12929238137'),(39,'54974237521'),(40,'38489835038'),(41,'44533765391'),
(42,'86492229008'),(43,'50038152576'),(44,'13461459047'),(45,'87829118169'),(46,'02620561741'),
(47,'26921969756'),(48,'05554174553'),(49,'86570205791'),(50,'69345367071'),(51,'38953649619'),
(52,'23481164192'),(53,'64544286965'),(54,'09820163230'),(55,'07714882750'),(56,'88321504269'),
(57,'51969546033'),(58,'89877317329');

SELECT Number_LibraryCard, COUNT(*) FROM Library_Card GROUP BY Number_LibraryCard HAVING COUNT(*)>1;
SELECT * FROM Library_Card;
go

INSERT INTO Store VALUES		
(100, 1, 1),(101, 1, 2),(102, 2, 1),(103, 2, 2),(104, 3, 1),(105, 3, 2),(106, 4, 1),(107, 4, 2),(108, 5, 1),(109, 5, 2),(110, 6, 1),(111, 6, 2),
(112, 1, 1),(113, 1, 2),(114, 2, 1),(115, 2, 2),(116, 3, 1),(117, 3, 2),(118, 4, 1),(119, 4, 2),(120, 5, 1),(121, 5, 2),(122, 6, 1),(123, 6, 2);

SELECT * FROM Store;
go
/*
SELECT * FROM Book;
DELETE FROM Book;
dbcc checkident (Book, reseed, 0);
*/
INSERT INTO Book VALUES
('Основы философии','Горелов А.А.','Академия','2013','87я723',50,100),
('Основы философии','Канке В.А.','Логос','2014','87.3',34,100),
('История. Учебник для СПО','В.В. Артемов,Ю.Н. Лубченков','Академия','2020','930.9',228,101),
('История. Учебник для СПО','В.В. Артемов,Ю.Н. Лубченков','Академия','2018','930.9',160,101),
('Профессиональная этика и психология делового общения', 'И.П. Кошевая, А.А. Канке','Форум','2021','87.75я73',55,102),
('Английский язык для технических специальностей','А.П. Голубев, А.П. Коржавый,И.Б. Смирнова.','Академия','2020','81.2Англ-9я723',60,103),
('Professional English','Фишман Л.М.','ИНФРА-М','2021','81.432.1', 80,103),
('Planet of  English','Г.Т.Бескоровайная, Н.И.Соколова, Е.А.Койранская,  Г.В.Лаврик','Академия','2017','81.2Англя723я722', 55,104),
('Физическая культура учебник для студентов СПО','Бишаева А.А.','Академия','2020','75я722',25,105),
('Физическая культура учебник для студентов СПО','Бишаева А.А.','Академия','2017','75я722',15,105),
('Элементы высшей математики: учебник для студентов  СПО','В.П. Григорьев, Ю.А. Дубинский','Академия','2020','22.1я723',34,106),
('Теория вероятностей и математическая статистика','В.А. Семенов','Питер','2013','22.17я7',40,106),
('Элементы высшей математики учебник  для СПО','В.П. Григорьев, Ю.А. Дубинский','Академия','2008','22.1я723',28,107),
('Дискретная математика сборник задач с алгоритмами решений для студ СПО','М.С. Спирина, П.А. Спирин','Академия','2016','В151.3я723-4',20,107),
('Дискретная математика: учебник для студ. СПО','М.С. Спирина, П.А. Спирин','Академия','2010','22.176я723',20,108),
('Теория вероятностей и математическая статистика: учебник для студ. СПО ','М.С. Спирина, П.А. Спирин','Академия','2019','22.172я723',22,108),
('Операционные системы','А.В. Батаев, Н.Ю. Налютина, С.В. Синицына','Академия','2013','32.973-018.2я723',30,109),
('Операционные системы','С.В. Кисилев','Академия','2013','32.973-018.2я723',33,109),
('Современные операционные системы','С. В. Назаров, А. И. Широков','ИНТУИТ','2011','32.973-018.2я7',24,110),
('Современные операционные системы','Таненбаум Э.','ПИТЕР','2011','32.973.3-018.2',18,110),
('Архитектура ЭВМ: учебное пособие','В.Д. Колдаев, С.А. Лупин','ФОРУМ','2021','32.973-02я723',30,111),
('Архитектура аппаратных средств: учебник для студ. учреждений сред.проф.образования','Сенкевич А.В.','Академия','2020','32.973-02я723',27,111),
('Информатика, автоматизированные информационные технологии и системы','В.А. Гвоздева','ИНФРА-М','2020','32.81я723',30,112),
('Информационные технологии : учебник для студентов СПО','Г.С. Гохберг','Академия','2020','32.81я723',34,112),
('Основы алгоритмизации и программирования: учебник для СПО','И.Г. Семакин, А. П. Шестаков','Академия','2020','22.18я723',43,113),
('Основы алгоритмизации и программирования. Практикум: учебное пособие для студ. СПО','И.Г. Семакин, А.П. Шестаков','Академия','2020','22.18я723',20,113),
('Правовое обеспечение профессиональной деятельности учебник для студентов СПО','В.В. Румынина','Академия','2018','67я723',20,114),
('Право для профессий и специальностей социально-экономического профиля: учебник для студентов СПО','Е.А. Певцова','Академия','2020','67я722',20,114),
('Безопасность жизнедеятельности: учебник пособие для студ. учреждений сред. проф. образования','А.И. Гомола, В.Е. Кириллов, П.А. Жанин','Академия','2020','68.9я722',30,115),
('Безопасность жизнедеятельности: учебное пособие','Л. Л. Никифоров, В. В. Персиянов','ИНФРА-М','2019','65.9(2)248я73',27,115),
('Экономика для профессий и специальностей соц-эконом профиля: пособие для студ. учреждений спо','А.И. Гомола, В.Е. Кириллов, П.А. Жанин','Академия','2018','33(075.32)',30,116),
('Экономика организации(предприятия): учебник для ср. спец. учеб. заведений','Сафронов, Н. А','ИНФРАМ-М','2011','65.9(2)',31,116),
('Основы проектирования баз данных: учебник пособие для студ. учреждений спо','Г.Н. Федорова','Академия','2020','681.8',37,117),
('Базы данных: учебник для ВПО','С.Д. Кузнецов','Академия','2012','3281я733',24,117),
('Метрология, стандартизация, сертификация, техническое регулирование и документоведение','В.Ю. Шишмарев','ИНФРА-М','2013','30.10я723',26,118),
('Основы метрологии, стандартизации и сертификации','Н.Д. Дубовой, Е.М. Портнов','ИНФРА-М','2019','32.97я723',25,118),
('Численные методы в программировании : учебное пособие для СПО','Н. В. Воронцова, Т. Н. Егорушкина, Д. И. Якушин','Ай Пи Эр Медиа','2019','22.1',33,119),
('Численные методы и программирование','В.Д. Колдаев','ИНФРА-М','2021','32.973-018я723',21,119),
('Компьютерные сети','Е.О. Новожилов, О.П. Новожилов','Академия','2013','32.973.202.2я723',28,120),
('Компьютерные сети. Принципы, технологии, протоколы: учебник для вузов','В. Олифер','ПИТЕР','2011','32.973.202я7',27,120),
('Менеджмент: учебник для студ. учреждений сред. проф. образование','Е.Л. Драчева','Академия','2020','65.290-2я723',26,121),
('Информационные технологии в менеджменте','К.В. Балдин','Академия','2012','65.291.21я7',29,121),
('Разработка модулей по для компьютерных систем: учебник для студ. учреждений спо','Г.Н. Федорова','Академия','2020','32.973.202-018.2я723',41,122),
('Осуществление интеграции пм: учебник студ. учреждений спо','Г.Н. Федорова','Академия','2018','32.973.202я723',22,122),
('Сопровождение и обслуживание по компьютерных систем: учеб. для студ. учреждений СПО','В.П. Зверева','Академия','2019','32.973-018.2я723',25,123),
('Разработка и эксплуатация удаленных баз данных: учебник для студентов СПО','Э.В. Фуфаев, Д.Э. Фуфаев','Академия','2014','32.81я723',36,123);

SELECT * FROM Book;
go
--SELECT gr.NumberGroup,COUNT(*) FROM Student AS st JOIN [Group] AS gr ON st.IdGroup = gr.IdGroup GROUP BY NumberGroup;  
--    ауцуаукацукпауау///00вцвйц///225208,вцвццвцвцвцвцц
